## Pandas, SQLite 활용한 베스크 크리스마스 영화 찾기

- Pandas 예제에서 활용하였던 MovieLens 데이터를 활용합니다.
- 데이터는 실습을 위해 SQLite database 형태로, 같은 폴더 내 db 폴더 내부에 추가하였습니다. : /db/movie_ratings.db

In [1]:
import sqlite3
import pandas.io.sql as sql

In [2]:
# movie_ratings.db와 연결
con = sqlite3.connect("./db/movie_ratings.db")

In [3]:
# 데이터가 잘 들어있는지 확인해보기
users = sql.read_sql_query("SELECT * FROM users;", con)
users.head()

   user_id gender  age  occupation    zip
0        1      F    1          10  48067
1        2      M   56          16  70072
2        3      M   25          15  55117
3        4      M   45           7  02460
4        5      M   25          20  55455

In [4]:
movies = sql.read_sql_query("SELECT * FROM movies;", con)
movies.head()

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy

In [5]:
ratings = sql.read_sql_query("SELECT * FROM ratings;", con)
ratings.head()

   user_id  movie_id  rating  timestamp
0        1      1193       5  978300760
1        1       661       3  978302109
2        1       914       3  978301968
3        1      3408       4  978300275
4        1      2355       5  978824291